if __name__ == '__main__':
    # ЗАВДАННЯ 1
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом:
    # якщо число кратне 7, його треба виводити на екран.


    # start = int(input("Початок: "))
    # end = int(input("Кінець: "))
    # for i in range(start, end + 1):
    #
    #     if i % 7 == 0:
    #      print(i, end=" ")

    # ЗАВДАННЯ 2
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Необхідно проаналізувати всі числа в цьому діапазоні.
    # Потрібно вивести на екран:
    # Всі числа діапазону.
    # Всі числа діапазону в спадному порядку.
    # Всі числа, кратні 7.
    # Кількість чисел, кратних 5.

    start = int(input("Початок діапазону: "))
    end = int(input("Кінець діапазону: "))

    for i in range

