if __name__ == '__main__':
    # ЗАВДАННЯ 1
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом:
    # якщо число кратне 7, його треба виводити на екран.


    # start = int(input("Початок: "))
    # end = int(input("Кінець: "))
    # for i in range(start, end + 1):
    #
    #     if i % 7 == 0:
    #      print(i, end=" ")


    # ЗАВДАННЯ 2
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Необхідно проаналізувати всі числа в цьому діапазоні.
    # Потрібно вивести на екран:
    # Всі числа діапазону.
    # Всі числа діапазону в спадному порядку.
    # Всі числа, кратні 7.
    # Кількість чисел, кратних 5.

    # start = int(input("Початок діапазону: "))
    # end = int(input("Кінець діапазону: "))
    #
    # for i in range(start, end + 1):            # створюємо цикл в діапазоні елементів від start до end + 1
    #                                            # ( +1 для того щоб прорахувати останній елемент end)
    #     print(i, end=" ")
    #
    # print()
    #
    # print("Усі числа діапазону за спаданням:")
    #
    # for i in range(end, start - 1, -1):         # створюємо цикл в діапазоні від останнього елементу ел-ту до першого
    #                                             # з кроком -1 для проходження списку в зворотньому порядку
    #
    #     print(i, end=" ")
    # print()
    #
    # print("Усі числа, кратні 7:")
    # for i in range(start, end + 1):
    #   if i % 7 == 0:                            # створюємо умову (при діленні чисе списку на число 7 без залишку)
    #         print(i, end=" ")
    # print()
    #
    # print("Кількість чисел, кратних 5:")
    #
    # count = 0                                   # створюємо лічильник
    # for i in range(start, end + 1):
    #   if i % 5 == 0:                            # створюємо умову (при діленні чисе списку на число 5 без залишку)
    #         count += 1
    # print(count)


    # ЗАВДАННЯ 3
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Потрібно проаналізувати всі числа в цьому діапазоні.
    # Виведення на екран має відбуватися за правилами, зазначеними нижче:

    # Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово "Fizz".
    # Якщо число кратне 5, потрібно вивести слово "Buzz".
    # Якщо число кратне 3 і 5,потрібно вивести "Fizz Buzz".
    # Якщо число не кратне ні 3, ні 5, потрібно вивести саме число.


    # start = int(input("Початок діапазону: "))
    # end = int(input("Кінець діапазону: "))
    # for i in range(start, end + 1):
    #     if i % 3 == 0:
    #         print("Fizz")
    #     elif i % 5 == 0:
    #         print("Buzz")
    # for i in range(start, end + 1):         # ще раз створюємо цикл, для того щоб виконати бінарну умову
    #     if i % 3 == 0 and i % 5 == 0:
    #         print("Fizz Buzz")                # якщо маємо тільки if,else - умова є бінарна
    #     else:
    #         print(i)
